In [1]:
#!pip -q install plotly --upgrade

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [2]:
# Carrego o dataset
dataset_titanic = pd.read_csv("train.csv")

In [3]:
# Olho as 5 primeiras linhas
dataset_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# Pego as colunas do dataset
dataset_titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
# Coloco a vari√°vel target pro final
dataset_titanic = pd.DataFrame(dataset_titanic, columns = ['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'])

In [6]:
# Olho os 5 primeiros registros
dataset_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [7]:
# Vejo a descri√ß√£o do dataset
dataset_titanic.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,14.526497,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [8]:
# Vejo a quantidade de linhas do dataset
len(dataset_titanic)

891

In [9]:
# Verifico a quantidade de dados NaN que exite
dataset_titanic.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

### 1. Fazendo o tratamento dos dados

In [10]:
# Parece que n√£o tem idade negativa
dataset_titanic[dataset_titanic['Age'] < 0].count()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
Survived       0
dtype: int64

In [11]:
# Buscando a m√©dia das idades
media_idade = dataset_titanic['Age'].mean()
media_idade

29.69911764705882

In [12]:
# # Troco os valores NaN da idade pela m√©dia das idades
dataset_titanic["Age"].fillna(media_idade, inplace = True)

In [13]:
# Verifico se tem valores NaN na coluna idade
dataset_titanic.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

## Removendo a coluna "Cabin"

Essa coluna tem 687 registros NaN de 891 linhas do dataset, menos de 25% dos dados da coluna possuem registros que n√£o s√£o NaN. Logo, √© preciso remover essa coluna.

In [14]:
# Removo a coluna
dataset_titanic = dataset_titanic.drop('Cabin', axis=1)

In [15]:
# Olho pro dataset para ver se a coluna foi removida
dataset_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0

In [16]:
# Verificar o tamanho do dataset
len(dataset_titanic)

891

## Tratando os 2 registros NaN da coluna Embarked

In [17]:
dataset_titanic.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
Survived       0
dtype: int64

In [18]:
# Procurando os dois valores nulos da coluna "Embarked"
dataset_titanic.loc[pd.isnull(dataset_titanic['Embarked'])]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
61,62,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN,1
829,830,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN,1

In [19]:
# Removendo os dois registros NaN
dataset_titanic.dropna(subset=['Embarked'], inplace=True)

In [20]:
# Verificando se os valores foram removidos
dataset_titanic.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Survived       0
dtype: int64

## 2. Fazendo a separa√ß√£o dos dados em treinamento e teste

In [21]:
# Vendo os dados
dataset_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0

In [22]:
# Criando uma vari√°vel para armazenar os valores previsores
x_dataset_titanic = dataset_titanic.iloc[:, 1:10].values

x_dataset_titanic

array([[3, 'Braund, Mr. Owen Harris', 'male', ..., 'A/5 21171', 7.25,
        'S'],
       [1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
        'female', ..., 'PC 17599', 71.2833, 'C'],
       [3, 'Heikkinen, Miss. Laina', 'female', ..., 'STON/O2. 3101282',
        7.925, 'S'],
       ...,
       [3, 'Johnston, Miss. Catherine Helen "Carrie"', 'female', ...,
        'W./C. 6607', 23.45, 'S'],
       [1, 'Behr, Mr. Karl Howell', 'male', ..., '111369', 30.0, 'C'],
       [3, 'Dooley, Mr. Patrick', 'male', ..., '370376', 7.75, 'Q']],
      dtype=object)

In [23]:
# Criando uma vari√°vel para armazenar a
y_dataset_titanic = dataset_titanic.iloc[:,10]

y_dataset_titanic

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 889, dtype: int64

## Tratando os dados categ√≥ricos

Os modelos de Machine Learning aceitam n√∫mero para o treinamento e n√£o strings, por isso que as strings da vari√°vel de treinamento devem ser tratadas. Ser√° usado o LabelEncoder para isso.

In [24]:
from sklearn.preprocessing import LabelEncoder

In [25]:
# Vejo a primeira linha do dataset de treinamento
x_dataset_titanic[0]

array([3, 'Braund, Mr. Owen Harris', 'male', 22.0, 1, 0, 'A/5 21171',
       7.25, 'S'], dtype=object)

In [26]:
# label Encoder pro nome
label_encoder_nome = LabelEncoder()

nome = label_encoder_nome.fit_transform(x_dataset_titanic[:,1])

In [27]:
nome

array([108, 190, 353, 272,  15, 553, 514, 623, 411, 575, 726,  95, 728,
        28, 838, 359, 681, 865, 837, 511, 273,  80, 522, 764, 625,  44,
       240, 260, 604, 811, 826, 775, 289, 854, 534, 372, 504, 134, 835,
       588,   7, 825, 445, 455, 212, 696, 472, 603, 725,  38, 628, 593,
       333, 246, 619, 871, 706, 594, 851, 299, 748, 337, 754, 783, 559,
       595, 185,  25, 439, 395, 300, 376, 161,  87, 545, 777, 562, 127,
       223, 840, 736, 518, 141, 385,  52, 255, 763, 259, 149, 159,  31,
       150, 209, 184, 739, 292, 308, 219, 421, 655, 657, 856, 404, 312,
       541, 723, 558, 674, 551, 666, 880,  67, 416,  46, 644, 178, 824,
        70,  24, 362, 550, 574, 846, 855, 587, 524, 498, 652, 234, 225,
       165, 694, 849, 771, 684, 584, 271, 617, 282,  99, 596, 319, 116,
        32, 585,  29, 254, 579, 121,  68, 642, 531, 887, 611, 864, 287,
       181, 766, 715, 186, 845,  82, 129, 627, 293, 157, 759,  69, 485,
       830, 679, 407, 751, 768, 443, 463, 387, 320, 473, 716, 649,  41,
        76, 440, 699, 600, 697, 101, 821, 663, 136,  20, 578, 113, 494,
       532, 610, 496, 879, 832, 720, 402, 876, 166, 787,  51,   9, 140,
        94,  12, 131, 648, 288, 436, 581, 375, 389,  72, 338, 789, 105,
       306, 580, 379,  83, 530, 491, 243, 466, 339, 459, 753,  43, 478,
       329, 370, 172, 647, 383, 881, 566, 169, 499,  47, 538, 480, 322,
        78, 147, 672, 788, 781, 486, 701, 817, 806, 156, 842, 635, 770,
        42, 797, 340, 356, 673, 630, 651, 305,  91, 125, 815, 529, 576,
       350,  33, 481, 633, 680,   2, 227, 613, 885, 221, 769, 778, 884,
       569, 378, 177,  65,  90, 476, 315, 540, 477, 324,  17, 713,  71,
       430, 517, 410, 427, 866,  16, 248, 646,   3, 263, 348, 709, 448,
       355, 342, 589, 422, 554, 857, 774, 211, 200, 761, 128, 721, 875,
       597,  60, 295, 363, 516, 636, 304, 836, 265, 210, 641, 117, 192,
        93, 577, 258, 170, 732, 262, 111, 767, 207, 183, 215, 607, 868,
       237,  37, 877, 833, 104, 270, 521, 544, 758, 886,  64,  40, 598,
         5, 843, 561, 399,  48, 328, 861,  75, 689, 624, 535, 453, 860,
        85, 314,  86, 571, 809, 373, 664, 205, 298, 118, 714, 467, 144,
       392, 313, 582, 727, 403, 612, 523, 622, 819, 591,   6, 417, 318,
       615, 274, 859, 686,  88, 464, 731, 343, 539, 191, 790, 527, 226,
       741, 512, 827, 281, 155, 882, 198, 700, 870, 162, 661, 249, 662,
        92, 808, 490, 419, 743, 143, 253, 687, 261, 446, 344, 323, 658,
       678, 401, 216, 528, 734,  55, 660, 852, 316, 257, 290, 643, 391,
       536, 435, 813, 602,  21, 556, 280, 537, 501, 296, 132, 765, 730,
        54, 429, 124, 853, 400, 785, 164, 675, 107, 424, 365, 297, 268,
       705, 823,  89, 465, 381, 434, 773, 182, 317, 869, 546,  39, 780,
       878, 242, 737,  18, 794, 130, 133, 606, 449, 500, 645, 669, 106,
       609, 454, 195, 847, 520, 704, 168, 841, 471, 708,  35, 640, 650,
       839, 447, 364, 426, 244, 688, 245, 724, 366, 668, 816, 236, 653,
       123, 341, 120, 460, 691, 266, 188,  26,  27,  73, 222, 586,  74,
       621, 294, 203, 802, 735, 599, 462, 608, 872, 228, 692, 798, 883,
       557, 750, 592, 745, 526, 204, 784, 626, 217, 415, 336,  36, 251,
       431, 707, 638, 277, 744, 135, 418, 160, 803, 224, 702, 639, 796,
       394, 267, 284, 565, 690, 782, 238, 100, 154, 828, 469, 408,  98,
       229, 390, 760, 335, 814, 374, 482, 423, 199, 457, 740,  30, 393,
       567, 377, 110, 357, 197, 487,  77, 279, 873, 438, 572, 327, 103,
       792, 441, 489,  96, 601,  66, 493, 776, 634, 756, 206, 468, 173,
       632, 807, 396, 722, 757, 252,  53, 332, 180, 746, 863, 779, 543,
       218, 420, 605, 352, 360, 670, 102, 232, 583, 264,  57, 171, 167,
       483, 361, 119, 698, 179, 800, 114, 202, 542, 862, 844, 231, 729,
       822, 302, 137, 654, 345, 614, 301, 112, 456, 631, 194, 247, 497,
       213, 425, 451, 712, 848, 153, 432, 564, 801, 382,  45, 742,  63,
       275, 326, 555, 433, 126, 163, 560, 513, 442, 799, 458, 307, 772,
       241, 820, 519, 409, 331, 398, 286, 368, 151, 616, 676, 506, 115,
       386,  14, 346, 444,  84, 818, 867, 256, 475, 388, 573, 347, 148,
       710, 525, 786, 187,   1, 747, 510, 176, 850, 548, 831, 414, 358,
       321, 138,  58, 804, 703, 276, 590,  62, 146, 233, 369, 109, 505,
       552, 309, 479, 397, 495, 235, 367, 568, 810, 239, 437, 693,  50,
       214, 488, 413,  13, 330, 752, 682, 208, 310, 428, 278, 718, 380,
       201, 620, 461, 618, 384, 829, 665, 174, 142, 805, 351, 405,  34,
       659, 533, 152,  10, 474, 762,  23, 812, 269, 354, 503, 371, 755,
       349, 492, 677, 549, 629, 250, 452, 502, 515, 874, 685, 711,  49,
        19, 175, 637, 749, 158, 507,  11, 563, 733, 470, 189,   0, 719,
       508, 334, 291,  22, 793,  97, 484, 145,   8, 858, 196,  56, 671,
       325, 283, 795, 717, 285, 122, 230, 695, 888, 406,  59,  79, 139,
       834,   4, 570, 311, 656, 450, 667, 738, 509, 193,  61, 791, 683,
       547, 303, 412,  81, 220])

In [28]:
# Label Encoder para o g√™nero
label_encoder_genero = LabelEncoder()

genero = label_encoder_genero.fit_transform(x_dataset_titanic[:,2])

In [29]:
# Comparar essa coluna com a coluna com Label Encoder
x_dataset_titanic[:2, 2]

array(['male', 'female'], dtype=object)

In [30]:
genero[:2]

array([1, 0])

In [32]:
# Label Encoder para o Ticket

label_encoder_ticket = LabelEncoder()

ticket = label_encoder_ticket.fit_transform(x_dataset_titanic[:,6])

In [33]:
x_dataset_titanic[:10,6], ticket[:10]

(array(['A/5 21171', 'PC 17599', 'STON/O2. 3101282', '113803', '373450',
        '330877', '17463', '349909', '347742', '237736'], dtype=object),
 array([522, 595, 668,  48, 471, 274,  84, 394, 343, 131]))

In [34]:
# Label Encoder para Embarked

label_encoder_embarked = LabelEncoder()

embarked = label_encoder_embarked.fit_transform(x_dataset_titanic[:, 8])

In [36]:
embarked[:10], x_dataset_titanic[:10, 8]

(array([2, 0, 2, 2, 2, 1, 2, 2, 2, 0]),
 array(['S', 'C', 'S', 'S', 'S', 'Q', 'S', 'S', 'S', 'C'], dtype=object))

In [37]:
# Agora ser√° feito a substitui√ß√£o dos dados categ√≥ricos pelos dados transformados

x_dataset_titanic[:, 1] = nome
x_dataset_titanic[:, 2] = genero
x_dataset_titanic[:, 6] = ticket
x_dataset_titanic[:, 8] = embarked

In [39]:
# Verificando se foi feito a altera√ß√£o
x_dataset_titanic[:20,]

array([[3, 108, 1, 22.0, 1, 0, 522, 7.25, 2],
       [1, 190, 0, 38.0, 1, 0, 595, 71.2833, 0],
       [3, 353, 0, 26.0, 0, 0, 668, 7.925, 2],
       [1, 272, 0, 35.0, 1, 0, 48, 53.1, 2],
       [3, 15, 1, 35.0, 0, 0, 471, 8.05, 2],
       [3, 553, 1, 29.69911764705882, 0, 0, 274, 8.4583, 1],
       [1, 514, 1, 54.0, 0, 0, 84, 51.8625, 2],
       [3, 623, 1, 2.0, 3, 1, 394, 21.075, 2],
       [3, 411, 0, 27.0, 0, 2, 343, 11.1333, 2],
       [2, 575, 0, 14.0, 1, 0, 131, 30.0708, 0],
       [3, 726, 0, 4.0, 1, 1, 615, 16.7, 2],
       [1, 95, 0, 58.0, 0, 0, 37, 26.55, 2],
       [3, 728, 1, 20.0, 0, 0, 534, 8.05, 2],
       [3, 28, 1, 39.0, 1, 5, 332, 31.275, 2],
       [3, 838, 0, 14.0, 0, 0, 412, 7.8542, 2],
       [2, 359, 0, 55.0, 0, 0, 152, 16.0, 2],
       [3, 681, 1, 2.0, 4, 1, 479, 29.125, 1],
       [2, 865, 1, 29.69911764705882, 0, 0, 150, 13.0, 2],
       [3, 837, 0, 31.0, 1, 0, 300, 18.0, 2],
       [3, 511, 0, 29.69911764705882, 0, 0, 183, 7.225, 0]], dtype=object)

## 3. Fazendo o escalonamento dos dados

N√∫meros grandes influenciam muito em compara√ß√£o com n√∫mero pequenos, por causa disso o modelo pode achar que uma vari√°vel possa ser mais importante que a outra, n√£o necessariamente √© importante fazer o escalonamento, por isso ser√° feito o treinamento com e escalonamento, nesse t√≥pico ser√° feito o escalonamento.

In [40]:
from sklearn.preprocessing import StandardScaler

In [41]:
# Fazendo o escalonamento e atribuindo no dataset
scaler_x_dataset_titanic = StandardScaler()
x_dataset_titanic = scaler_x_dataset_titanic.fit_transform(x_dataset_titanic)

In [42]:
# Verificando o escalonamento
x_dataset_titanic

array([[ 0.82520863, -1.30926758,  0.73534203, ...,  0.91701764,
        -0.50023975,  0.58683958],
       [-1.57221121, -0.98974394, -1.35991138, ...,  1.28135338,
         0.78894661, -1.93955453],
       [ 0.82520863, -0.3545933 , -1.35991138, ...,  1.64568912,
        -0.48664993,  0.58683958],
       ...,
       [ 0.82520863, -0.12469215, -1.35991138, ...,  1.67563453,
        -0.17408416,  0.58683958],
       [-1.57221121, -1.41447658,  0.73534203, ..., -1.64830528,
        -0.0422126 , -1.93955453],
       [ 0.82520863, -0.87284505,  0.73534203, ...,  0.6325363 ,
        -0.49017322, -0.67635748]])

In [43]:
y_dataset_titanic

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 889, dtype: int64

## 4. Dividindo o dataset em treinamento e teste para o modelo

In [44]:
from sklearn.model_selection import train_test_split

In [50]:
# Separando o dataset em treino e teste
x_treino, x_teste, y_treino, y_teste = train_test_split(x_dataset_titanic, y_dataset_titanic, test_size=0.3, random_state=0)

In [51]:
x_treino.shape, y_treino.shape

((622, 9), (622,))

In [52]:
x_teste.shape, y_teste.shape

((267, 9), (267,))

## 4.1 Salvar os datasets de treino e teste

Para n√£o rodar v√°rias vezes e ter separa√ß√£o diferentes, ser√° usado a biblioteca pickle para salvar os dados e os usar depois para o treinamento

In [53]:
import pickle

In [54]:
# Cria arquivos e salva os dados
with open("titanic.pkl", mode='wb') as f:
    pickle.dump([x_treino, x_teste, y_treino, y_teste], f)

## 5. Usando o algoritmo Naive Bayes para o aprendizado de m√°quina